---
kind: property
id: P:Autodesk.Revit.DB.FabricationServiceButton.Name
source: html/ef339ee7-0e6d-86a5-dad8-9f24bfbaf9d1.htm
---
# Autodesk.Revit.DB.FabricationServiceButton.Name Property

The name of the button.

## Syntax (C#)
```csharp
public string Name { get; }
```